<details ><summary>plan for terraform_eks 2025-12-15 16:13:06 (UTC)</summary>
          <details ><summary>Additional output for <b>kvlxj/bluejeay-lab#terraform_eks</b></summary>

```terraform


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By Prisma Cloud | version: 3.2.22 
Update available 3.2.22 -> 3.2.495
Run pip3 install -U checkov to update 


terraform scan results:

Passed checks: 1, Failed checks: 4, Skipped checks: 0

Check: CKV_AWS_41: "Ensure no hard coded AWS access key and secret key exists in provider"
	PASSED for resource: aws.default
	File: /providers.tf:1-6
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/aws-policies/secrets-policies/bc-aws-secrets-5
Check: CKV_TF_1: "Ensure Terraform module sources use a commit hash"
	FAILED for resource: eks
	File: /eks.tf:1-66
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/supply-chain-policies/terraform-policies/ensure-terraform-module-sources-use-git-url-with-commit-hash-revision

		Code lines for this resource are too many. Please use IDE of your choice to review the file.
Check: CKV_TF_1: "Ensure Terraform module sources use a commit hash"
	FAILED for resource: aws_ebs_csi_pod_identity
	File: /iam.tf:1-15
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/supply-chain-policies/terraform-policies/ensure-terraform-module-sources-use-git-url-with-commit-hash-revision

		1  | module "aws_ebs_csi_pod_identity" {
		2  |   source = "terraform-aws-modules/eks-pod-identity/aws"
		3  | 
		4  |   name = "${var.name}aws-ebs-csi"
		5  | 
		6  |   attach_aws_ebs_csi_policy = true
		7  | 
		8  |   associations = {
		9  |     (var.name) = {
		10 |       cluster_name    = module.eks.cluster_name
		11 |       namespace       = "kube-system"
		12 |       service_account = "ebs-csi-controller-sa"
		13 |     }
		14 |   }
		15 | }

Check: CKV_TF_1: "Ensure Terraform module sources use a commit hash"
	FAILED for resource: aws_vpc_cni_ipv4_pod_identity
	File: /iam.tf:17-32
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/supply-chain-policies/terraform-policies/ensure-terraform-module-sources-use-git-url-with-commit-hash-revision

		17 | module "aws_vpc_cni_ipv4_pod_identity" {
		18 |   source = "terraform-aws-modules/eks-pod-identity/aws"
		19 | 
		20 |   name = "${var.name}-aws-vpc-cni-ipv4"
		21 | 
		22 |   attach_aws_vpc_cni_policy = true
		23 |   aws_vpc_cni_enable_ipv4   = true
		24 | 
		25 |   associations = {
		26 |     (var.name) = {
		27 |       cluster_name    = module.eks.cluster_name
		28 |       namespace       = "kube-system"
		29 |       service_account = "aws-node"
		30 |     }
		31 |   }
		32 | }

Check: CKV_TF_1: "Ensure Terraform module sources use a commit hash"
	FAILED for resource: aws_lb_controller_pod_identity
	File: /iam.tf:34-48
	Guide: https://docs.prismacloud.io/en/enterprise-edition/policy-reference/supply-chain-policies/terraform-policies/ensure-terraform-module-sources-use-git-url-with-commit-hash-revision

		34 | module "aws_lb_controller_pod_identity" {
		35 |   source = "terraform-aws-modules/eks-pod-identity/aws"
		36 | 
		37 |   name = "${var.name}-aws-lb-controller"
		38 | 
		39 |   attach_aws_lb_controller_policy = true
		40 | 
		41 |   associations = {
		42 |     (var.name) = {
		43 |       cluster_name    = module.eks.cluster_name
		44 |       namespace       = "kube-system"
		45 |       service_account = "aws-load-balancer-controller-sa"
		46 |     }
		47 |   }
		48 | }



```
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:eu-west-3:258106547593:access-entry/bluejeay-lab-eks/user/258106547593/kv.aws@jeay.io/becd8df4-83cb-5094-9df2-262910f76f6a" -> (known after apply)
      ~ created_at        = "2025-12-14T08:10:15Z" -> (known after apply)
      ~ id                = "bluejeay-lab-eks:arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-12-14T08:10:15Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> "arn:aws:iam::258106547593:user/ci" # forces replacement
      - tags              = {} -> null
      ~ user_name         = "arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-12-14 08:10:16.084 +0000 UTC" -> (known after apply)
      ~ id            = "bluejeay-lab-eks#arn:aws:iam::258106547593:user/kv.aws@jeay.io#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-12-14 08:10:16.084 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> "arn:aws:iam::258106547593:user/ci" # forces replacement
        # (3 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "9b6d4c26-5cde-4ddf-8d5c-a05407eb87f8"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::258106547593:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::258106547593:user/kv.aws@jeay.io" -> "arn:aws:iam::258106547593:user/ci"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::258106547593:role/bluejeay-lab-eks-cluster-20251214080020692400000009"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (terraform_eks)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
|  CHANGE  |                                   RESOURCE                                   |
|----------|------------------------------------------------------------------------------|
| update   | `module.eks.module.kms.aws_kms_key.this[0]`                                  |
| recreate | `module.eks.aws_eks_access_entry.this["cluster_creator"]`                    |
|          | `module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p terraform_eks
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>